# SetGraphicOverrides Method

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
WorksharingDisplaySettings..::..SetGraphicOverrides Method
WorksharingDisplaySettings Class See Also
---
# Overload List
| Name | Description |
| --- | --- |
| --- | --- | --- |
| SetGraphicOverrides(String, WorksharingDisplayGraphicSettings) | Sets the graphic overrides assigned to elements owned by a particular user. The username cannot be on the list of removed usernames. |
| SetGraphicOverrides(CheckoutStatus, WorksharingDisplayGraphicSettings) | Sets the graphic overrides assigned to elements with a particular ownership status. |
| SetGraphicOverrides(ModelUpdatesStatus, WorksharingDisplayGraphicSettings) | Sets the graphic overrides assigned to elements with a particular status in the central model. |
| SetGraphicOverrides(WorksetId, WorksharingDisplayGraphicSettings) | Sets the graphic overrides assigned to elements in a particular user workset. |

# See Also
WorksharingDisplaySettings Class
WorksharingDisplaySettings Members
Autodesk.Revit.DB Namespace